const faqItems = [
  {
    question: '프론트엔드 개발자의 주요 역할은 무엇인가요?',
    answer:
      '프론트엔드 개발자는 사용자가 직접 상호작용하는 웹사이트나 애플리케이션의 인터페이스를 설계하고 구현합니다. HTML, CSS, JavaScript를 사용하여 반응형 디자인을 만들고, 사용자 경험을 최적화하는 것이 주요 역할입니다.',
  },
  {
    question: 'React와 Vue.js 중 어떤 것을 선호하시나요?',
    answer: `첫 프론트엔드 개발은 Vue.js로 시작 하였습니다. 
      Vue.js는 학습 곡선이 낮고 직관적이었기에 습득 과정이 빨랐습니다만, 코어한 프론트엔드 이해까지는 가지 못하였습니다. 
      이후에는 계속해서 React를 사용하여 개발 해오며 딥하게 파고 들었습니다. Vue.js 계속해서 마이그레이션을 하고 있으며,
      프로젝트의 요구사항과 팀의 경험에 따라 선택할 수 있습니다.`,
  },
  {
    question: '웹 성능 최적화를 위한 팁은 무엇인가요?',
    answer:
      '웹 성능 최적화를 위해 이미지 압축, 코드 분할, 지연 로딩, 캐싱 전략 사용, CSS/JavaScript 최소화, CDN 활용 등의 기법을 사용할 수 있습니다. 또한, 성능 모니터링 도구를 활용하여 지속적으로 성능을 체크하고 개선하는 것이 중요합니다.',
  },
];

export default faqItems;
